1. Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

In [1]:
# imports
import numpy as np
import pandas as pd
from scipy import stats
from pydataset import data
from env import usr, pw, host
from sqlalchemy import create_engine

In [ ]:
Codeup Student 	Not Codeup Student
Uses a Macbook 	49 	20
Doesn't Use A Macbook 	1 	30

In [3]:
contingency = pd.DataFrame({'codeup_student': [49,1], 'not_codeup_student': [20,30]}, index=['uses_macbook', 'not_macbook'])

In [4]:
contingency

              codeup_student  not_codeup_student
uses_macbook              49                  20
not_macbook                1                  30

In [ ]:
# Establish a null hypothesis

In [5]:
# H0: Macbook Usage is independent of being a Codeup student

In [6]:
chi2, p, degf, expected = stats.chi2_contingency(contingency)

In [7]:
confidence = 0.95
alpha = 1- confidence

In [9]:
print('Observed:\n:')
print(contingency)
print('~~~~~~~~~~~~~~~~~~~~~~')
print('Expected: \n')
print(pd.DataFrame(expected, index=contingency.index, columns=contingency.columns))
print('~~~~~~~~~~~~~~~~~~~~~~')
print(f'chi^2 value: {chi2:.4f}')
print(f'p value: {p:.8f}')
if p < alpha:
    print('Our p value is less than our alpha and we can reject the null hypothesis, indicating that macbook use is not necessarily independent of codeup matriculation')
else:
    print('We cannot reject the null hypothesis')

Observed:
:
              codeup_student  not_codeup_student
uses_macbook              49                  20
not_macbook                1                  30
~~~~~~~~~~~~~~~~~~~~~~
Expected:

              codeup_student  not_codeup_student
uses_macbook            34.5                34.5
not_macbook             15.5                15.5
~~~~~~~~~~~~~~~~~~~~~~
chi^2 value: 36.6526
p value: 0.00000000
Our p value is less than our alpha and we can reject the null hypothesis, indicating that macbook use is not necessarily independent of codeup matriculation

### 2. Choose another 2 categorical variables from the mpg dataset and perform a chi2 contingency table test with them. Be sure to state your null and alternative hypotheses.

In [10]:
mpg = data('mpg')

In [11]:
data('mpg', show_doc='True')

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [12]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [15]:
mpg['class'].value_counts()

suv           62
compact       47
midsize       41
subcompact    35
pickup        33
minivan       11
2seater        5
Name: class, dtype: int64

In [16]:
mpg['manufacturer'].value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
subaru        14
hyundai       14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [18]:
observed = pd.crosstab(mpg['class'], mpg['manufacturer'])
observed

manufacturer,audi,chevrolet,dodge,ford,honda,hyundai,jeep,land rover,lincoln,mercury,nissan,pontiac,subaru,toyota,volkswagen
class,,,,,,,,,,,,,,,
2seater,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0
compact,15,0,0,0,0,0,0,0,0,0,2,0,4,12,14
midsize,3,5,0,0,0,7,0,0,0,0,7,5,0,7,7
minivan,0,0,11,0,0,0,0,0,0,0,0,0,0,0,0
pickup,0,0,19,7,0,0,0,0,0,0,0,0,0,7,0
subcompact,0,0,0,9,9,7,0,0,0,0,0,0,4,0,6
suv,0,9,7,9,0,0,8,4,3,4,4,0,6,8,0

In [19]:
# Null hypothesis:
#  H0: Vehicle manufacturer is independent of vehicle class type
# keep same alpha and confidence : 0.05 / .95

In [20]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [21]:
print('Observed:\n')
print(observed)
print('~~~~~~~~~~~~~~~~~~~~~~')
print('Expected: \n')
print(pd.DataFrame(expected, index=observed.index, columns=observed.columns))
print('~~~~~~~~~~~~~~~~~~~~~~')
print(f'chi^2 value: {chi2:.4f}')
print(f'p value: {p:.8f}')
print(f'degrees of freedom: {degf}')
if p < alpha:
    print('''Our p value is less than our alpha and we can reject the null hypothesis
         We can suggest that vehicle class type if not independent of manufacturer''')
else:
    print('We cannot reject the null hypothesis')

Observed:

manufacturer  audi  chevrolet  dodge  ford  honda  hyundai  jeep  land rover  \
class
2seater          0          5      0     0      0        0     0           0
compact         15          0      0     0      0        0     0           0
midsize          3          5      0     0      0        7     0           0
minivan          0          0     11     0      0        0     0           0
pickup           0          0     19     7      0        0     0           0
subcompact       0          0      0     9      9        7     0           0
suv              0          9      7     9      0        0     8           4

manufacturer  lincoln  mercury  nissan  pontiac  subaru  toyota  volkswagen
class
2seater             0        0       0        0       0       0           0
compact             0        0       2        0       4      12          14
midsize             0        0       7        5       0       7           7
minivan             0        0       0        0       0       0           0
pickup              0        0       0        0       0       7           0
subcompact          0        0       0        0       4       0           6
suv                 3        4       4        0       6       8           0
~~~~~~~~~~~~~~~~~~~~~~
Expected:

manufacturer      audi  chevrolet     dodge      ford     honda   hyundai  \
class
2seater       0.384615   0.405983  0.790598  0.534188  0.192308  0.299145
compact       3.615385   3.816239  7.431624  5.021368  1.807692  2.811966
midsize       3.153846   3.329060  6.482906  4.380342  1.576923  2.452991
minivan       0.846154   0.893162  1.739316  1.175214  0.423077  0.658120
pickup        2.538462   2.679487  5.217949  3.525641  1.269231  1.974359
subcompact    2.692308   2.841880  5.534188  3.739316  1.346154  2.094017
suv           4.769231   5.034188  9.803419  6.623932  2.384615  3.709402

manufacturer      jeep  land rover   lincoln   mercury    nissan   pontiac  \
class
2seater       0.170940    0.085470  0.064103  0.085470  0.277778  0.106838
compact       1.606838    0.803419  0.602564  0.803419  2.611111  1.004274
midsize       1.401709    0.700855  0.525641  0.700855  2.277778  0.876068
minivan       0.376068    0.188034  0.141026  0.188034  0.611111  0.235043
pickup        1.128205    0.564103  0.423077  0.564103  1.833333  0.705128
subcompact    1.196581    0.598291  0.448718  0.598291  1.944444  0.747863
suv           2.119658    1.059829  0.794872  1.059829  3.444444  1.324786

manufacturer    subaru    toyota  volkswagen
class
2seater       0.299145  0.726496    0.576923
compact       2.811966  6.829060    5.423077
midsize       2.452991  5.957265    4.730769
minivan       0.658120  1.598291    1.269231
pickup        1.974359  4.794872    3.807692
subcompact    2.094017  5.085470    4.038462
suv           3.709402  9.008547    7.153846
~~~~~~~~~~~~~~~~~~~~~~
chi^2 value: 464.3721
p value: 0.00000000
degrees of freedom: 84
Our p value is less than our alpha and we can reject the null hypothesis
         We can suggest that vehicle class type if not independent of manufacturer

In [22]:
observed.shape

(7, 15)

In [24]:
7 * 15

105

## 3. Use the data from the employees database to answer these questions:

### Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

In [25]:
# set up sql connection

In [26]:
def get_connection(db, user, host, password):
    url = f'mysql+pymysql://{user}:{password}@{host}/{db}'
    return create_engine(url)

In [27]:
conn = get_connection('employees', usr, host, pw)

In [28]:
# make our query for the parameters that we want:

In [29]:
query = '''SELECT e.gender, d.dept_name
FROM employees e
JOIN dept_emp de ON de.emp_no = e.emp_no
AND de.to_date > NOW()
JOIN departments d ON d.dept_no = de.dept_no'''

In [30]:
# load up our data
gender_dept = pd.read_sql(query, conn)

In [31]:
gender_dept.head()

  gender         dept_name
0      M  Customer Service
1      F  Customer Service
2      M  Customer Service
3      F  Customer Service
4      F  Customer Service

In [34]:
gender_dept = gender_dept[(gender_dept.dept_name == 'Sales') | (gender_dept.dept_name == 'Marketing')]

In [35]:
gender_dept

       gender  dept_name
104290      F  Marketing
104291      M  Marketing
104292      F  Marketing
104293      F  Marketing
104294      F  Marketing
...       ...        ...
240119      F      Sales
240120      M      Sales
240121      M      Sales
240122      F      Sales
240123      F      Sales

[52543 rows x 2 columns]

In [36]:
observed = pd.crosstab(gender_dept.dept_name, gender_dept.gender)

In [37]:
observed

gender         F      M
dept_name
Marketing   5864   8978
Sales      14999  22702

In [38]:
# H0: Gender is independent of status in sales vs marketing departments

In [39]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [40]:
print('Observed:\n')
print(observed)
print('~~~~~~~~~~~~~~~~~~~~~~')
print('Expected: \n')
print(pd.DataFrame(expected, index=observed.index, columns=observed.columns))
print('~~~~~~~~~~~~~~~~~~~~~~')
print(f'chi^2 value: {chi2:.4f}')
print(f'p value: {p:.8f}')
print(f'degrees of freedom: {degf}')
if p < alpha:
    print('''Our p value is less than our alpha and we can reject the null hypothesis
         We can suggest working in Sales compared to Marketing is not independent of employee gender''')
else:
    print('We cannot reject the null hypothesis')

Observed:

gender         F      M
dept_name
Marketing   5864   8978
Sales      14999  22702
~~~~~~~~~~~~~~~~~~~~~~
Expected:

gender                F             M
dept_name
Marketing   5893.242601   8948.757399
Sales      14969.757399  22731.242601
~~~~~~~~~~~~~~~~~~~~~~
chi^2 value: 0.3240
p value: 0.56919386
degrees of freedom: 1
We cannot reject the null hypothesis

#### Is an employee's gender independent of whether or not they are or have been a manager?

In [41]:
query = '''SELECT e.gender, dm.dept_no AS manager_status
FROM employees e
LEFT JOIN dept_manager dm ON dm.emp_no = e.emp_no'''

In [42]:
gender_mngr = pd.read_sql(query, conn)

In [43]:
gender_mngr.head()

  gender manager_status
0      M           None
1      F           None
2      M           None
3      M           None
4      M           None

In [45]:
gender_mngr.fillna(0, inplace=True)

In [46]:
gender_mngr['manager_status'] = gender_mngr.manager_status.apply(lambda x: x if x==0 else 1)

In [47]:
gender_mngr.manager_status.value_counts()

0    300000
1        24
Name: manager_status, dtype: int64

In [48]:
observed = pd.crosstab(gender_mngr.gender, gender_mngr.manager_status)

In [49]:
ch12, p, _, expected = stats.chi2_contingency(observed)

In [52]:
print('Observed:\n')
print(observed)
print('~~~~~~~~~~~~~~~~~~~~~~')
print('Expected: \n')
print(pd.DataFrame(expected, index=observed.index, columns=observed.columns))
print('~~~~~~~~~~~~~~~~~~~~~~')
print(f'chi^2 value: {ch12:.4f}')
print(f'p value: {p:.8f}')
if p < alpha:
    print('''Our p value is less than our alpha and we can reject the null hypothesis
         We can suggest gender of employee is not independent of history as a manager''')
else:
    print('We cannot reject the null hypothesis')

Observed:

manager_status       0   1
gender
F               120038  13
M               179962  11
~~~~~~~~~~~~~~~~~~~~~~
Expected:

manager_status              0          1
gender
F               120041.396688   9.603312
M               179958.603312  14.396688
~~~~~~~~~~~~~~~~~~~~~~
chi^2 value: 1.4567
p value: 0.22745819
We cannot reject the null hypothesis